HOST = '127.0.0.1'
# HOST = '122.51.67.37'
USER = 'root'
PWD = 'mm123456'
DB_NAME = 'public'
# 王者菜单提示

TIPS = {
    'bz': 'tips：发送“{}壁纸”可获取{}全皮肤壁纸哦，发送“菜单”可查看完整关键字列表',
    'jn': 'tips：发送“{}技能”可快速了解{}技能介绍哦，发送“菜单”可查看完整关键字列表',
    'sl': 'tips：发送“{}胜率”可查看{}最新胜率榜哦，发送“菜单”可查看完整关键字列表',
    'cz': 'tips：发送“{}出装”可查看{}出装推荐哦，发送“菜单”可查看完整关键字列表',
    'mw': 'tips：发送“{}铭文”可查看{}最新铭文搭配哦，发送“菜单”可查看完整关键字列表',
    'kz': 'tips：发送“{}克制”可查看{}英雄克制关系哦，发送“菜单”可查看完整关键字列表',
    'js': 'tips：发送“{}介绍”可查看{}的故事介绍哦，发送“菜单”可查看完整关键字列表',
    'zh': 'tips：发送“{}组合”可查看{}双/三排组合推荐哦，发送“菜单”可查看完整关键字列表',
    'jq': 'tips：发送“{}技巧”可查看{}使用技巧哦，发送“菜单”可查看完整关键字列表',
}